<?php
/*
r => reverse
a => associative
k => sort by key
u => user defined function

sort() - сортира масива по ASC по стойности, и не пази ключовете.
rsort() - сортира масива по DESC по стойности, и не пази ключовете.
asort() - сортира масива по ASC по стойности и пази ключовете.
arsort()- сортира масива по DESC по стойности и пази ключовете.
ksort() - сортира масива по ASC по ключове.
krsort() - сортира масива по DESC по ключове.
usort($arr, fn) - сортира масив по зададени критерии без да пази ключовете и без да има достъп до тях.
uksort($arr, fn) - сортира масив по зададени критерии по ключове без да има достъп до стойностите.
- ако искаме да има достъп до стойностите, трябва да ги вземем през ключа.
- но за да ги вземем през ключа, трябва да use-нем масива.

function($key1, $key2) use ($array) {
    //
}
*/